# Import niezbędnych bibliotek.

In [1]:
import numpy as np
import pandas as pd

# Wczytanie danych.

In [2]:
df = pd.read_csv('df1.csv')
df_2 = pd.read_csv('df2.csv')
df_3 = pd.read_csv('attrition.csv')
df_4 = pd.read_csv('sample_output.csv')

# Połączenie plików w jeden główny.
Sprawdzamy liczbę kolumn i wierszy.

In [3]:
print(df.shape)
print(df_2.shape)
print(df_3.shape)
print(df_4.shape)

(4449, 20)
(4449, 17)
(4449, 2)
(147, 2)

In [4]:
df.head(2)

,EmployeeNumber,Age,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked
0,104,30.0,Travel_Rarely,852.0,Research & Development,1.0,1.0,Life Sciences,1.0,4.0,Male,55.0,2.0,2.0,Laboratory Technician,4.0,Married,5126.0,15998.0,1.0
1,1638,38.0,Travel_Rarely,397.0,Research & Development,2.0,2.0,Medical,1.0,4.0,Female,54.0,2.0,3.0,Manufacturing Director,3.0,Married,7756.0,14199.0,3.0

In [5]:
df_2.head(2)

,EmployeeNumber,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,Attrition,YearlyIncome
0,104,Y,Yes,12.0,3.0,3.0,80.0,2.0,10.0,1.0,2.0,10.0,8.0,3.0,0.0,No,61512.0
1,1638,Y,Yes,19.0,3.0,4.0,80.0,1.0,10.0,6.0,4.0,5.0,4.0,0.0,2.0,No,93072.0

In [6]:
df_3.head(2)

   EmployeeNumber Attrition
0             104        No
1            1638        No

Czwarty dataset dotyczcy pracowników o innych indeksach, zatem nie bierzemy go pod uwagę.

In [7]:
df_4.head(2)

   EmployeeNumber  Attrition
0          100000          1
1          100001          1

Mergujemy dane komendą join, dołączając poszczególne pliki do pierwszego df.

In [8]:
df = df.join(df_2, lsuffix='_caller', rsuffix='_other')
df = df.join(df_3, lsuffix='_caller', rsuffix='_other')

Sprawdzamy, czy zgadza się liczba kolumn w pliku.

In [9]:
df.shape

(4449, 39)

# Sprawdzenie danych.

## Sprawdzenie, czy dane się nie duplikują.

In [10]:
df.columns

Index(['EmployeeNumber_caller', 'Age', 'BusinessTravel', 'DailyRate',
       'Department', 'DistanceFromHome', 'Education', 'EducationField',
       'EmployeeCount', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'EmployeeNumber_other', 'Over18', 'OverTime', 'PercentSalaryHike',
       'PerformanceRating', 'RelationshipSatisfaction', 'StandardHours',
       'StockOptionLevel', 'TotalWorkingYears', 'TrainingTimesLastYear',
       'WorkLifeBalance', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YearsWithCurrManager', 'Attrition_caller',
       'YearlyIncome', 'EmployeeNumber', 'Attrition_other'],
      dtype='object')

In [11]:
df = df.T.drop_duplicates().T

In [12]:
df.shape

(4449, 36)